# ─── Terminal & Shell ─────────────────────────────────────
brew "zsh"
brew "tmux"
brew "starship"
brew "stow"

# ─── Modern CLI Replacements ─────────────────────────────
brew "fzf"
brew "ripgrep"
brew "bat"
brew "eza"
brew "zoxide"
brew "fd"
brew "git-delta"

# ─── Productivity ────────────────────────────────────────
brew "lazygit"
brew "btop"
brew "tldr"
brew "jq"
brew "yq"
brew "direnv"
brew "mise"
brew "tree"
brew "wget"

# ─── Editor ──────────────────────────────────────────────
brew "neovim"

# ─── macOS Only ──────────────────────────────────────────
if OS.mac?
  cask "font-jetbrains-mono-nerd-font"
  cask "font-fira-code-nerd-font"
end
