# ─── Terminal & Shell ─────────────────────────────────────
brew "zsh"
brew "tmux"
brew "starship"
brew "stow"

# ─── Modern CLI Replacements ─────────────────────────────
brew "fzf"           # Fuzzy finder (Ctrl+T, Ctrl+R, Alt+C)
brew "ripgrep"       # grep replacement (rg)
brew "bat"           # cat replacement with syntax highlighting
brew "eza"           # ls replacement with icons and git status
brew "zoxide"        # cd replacement - smart directory jumping (z)
brew "fd"            # find replacement
brew "git-delta"     # diff replacement with side-by-side view
brew "sd"            # sed replacement with intuitive syntax
brew "dust"          # du replacement with visual output
brew "trash"         # Safe rm - sends to trash instead of delete

# ─── Shell Enhancement ───────────────────────────────────
brew "atuin"         # Shell history with SQLite, fuzzy search, sync

# ─── File Management ─────────────────────────────────────
brew "yazi"          # Terminal file manager with image previews

# ─── Productivity ────────────────────────────────────────
brew "lazygit"       # Terminal UI for git
brew "gh"            # GitHub CLI
brew "btop"          # System monitor (htop replacement)
brew "tldr"          # Simplified man pages with examples
brew "jq"            # JSON processor
brew "yq"            # YAML/TOML processor
brew "direnv"        # Per-directory environment variables
brew "mise"          # Polyglot version manager (node, python, etc.)
brew "wget"          # HTTP downloader
brew "hyperfine"     # Command-line benchmarking tool

# ─── Editor ──────────────────────────────────────────────
brew "neovim"

# ─── macOS Only ──────────────────────────────────────────
if OS.mac?
  cask "font-jetbrains-mono-nerd-font"
  cask "font-fira-code-nerd-font"
  cask "ghostty"
end
